app/views/devise/sessions/new.html.erb

SELECT "users".* FROM "users"
---
      <tbody>
        <% User.all.each do |user| %>