app/controllers/user_informations_controller.rb

SELECT COUNT(*) FROM "user_informations" WHERE "user_informations"."name" = $1  [["name", "Inocencia Quigley"]]
SELECT  "user_informations".* FROM "user_informations" WHERE (name like 'luis%') LIMIT $1  [["LIMIT", 1]]
SELECT  "user_informations".* FROM "user_informations" LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "user_informations"
---
  def index
    if params[:search]
      @user_informations = UserInformation.where("name like ?", "%#{params[:search]}%").page params[:page]
    else
      @user_informations = UserInformation.all.page params[:page]

INSERT INTO "user_informations" ("name", "cpf", "email", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user_information = UserInformation.new(user_information_params)

    respond_to do |format|
      if @user_information.save

SELECT  "user_informations".* FROM "user_informations" WHERE "user_informations"."id" = $1 ORDER BY "user_informations"."created_at" DESC LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def set_user_information
      @user_information = UserInformation.find(params[:id])